read_verilog -sv -Isrc/common src/dat/DAT.v

hierarchy -check -top DAT


proc; #opt;
fsm; #opt; 
memory; #opt

techmap; #opt

dfflibmap -liberty syn/cmos_cells.lib
#home/isolis/Documentos/Digitales2/yosys-yosys-0.6/examples/cmos/cmos_cells.lib


abc  -liberty  syn/cmos_cells.lib
#/home/isolis/Documentos/Digitales2/yosys-yosys-0.6/examples/cmos/cmos_cells.lib
#read_liberty cmos_cells.lib
clean


write_verilog -noattr src/synthetized/DAT.v 
